GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f56q43.inc
;----- NCO2ACCU Bits -----------------------------------------------------
NCO2ACC16        EQU  H'0000'
NCO2ACC17        EQU  H'0001'
NCO2ACC18        EQU  H'0002'
NCO2ACC19        EQU  H'0003'

ACC16            EQU  H'0000'
ACC17            EQU  H'0001'
ACC18            EQU  H'0002'
ACC19            EQU  H'0003'



;----- NCO2INCL Bits -----------------------------------------------------
NCO2INC0         EQU  H'0000'
NCO2INC1         EQU  H'0001'
NCO2INC2         EQU  H'0002'
NCO2INC3         EQU  H'0003'
NCO2INC4         EQU  H'0004'
NCO2INC5         EQU  H'0005'
NCO2INC6         EQU  H'0006'
NCO2INC7         EQU  H'0007'

INC0             EQU  H'0000'
INC1             EQU  H'0001'
INC2             EQU  H'0002'
INC3             EQU  H'0003'
INC4             EQU  H'0004'
INC5             EQU  H'0005'
INC6             EQU  H'0006'
INC7             EQU  H'0007'



;----- NCO2INCH Bits -----------------------------------------------------
NCO2INC8         EQU  H'0000'
NCO2INC9         EQU  H'0001'
NCO2INC10        EQU  H'0002'
NCO2INC11        EQU  H'0003'
NCO2INC12        EQU  H'0004'
NCO2INC13        EQU  H'0005'
NCO2INC14        EQU  H'0006'
NCO2INC15        EQU  H'0007'

INC8             EQU  H'0000'
INC9             EQU  H'0001'
INC10            EQU  H'0002'
INC11            EQU  H'0003'
INC12            EQU  H'0004'
INC13            EQU  H'0005'
INC14            EQU  H'0006'
INC15            EQU  H'0007'



;----- NCO2INCU Bits -----------------------------------------------------
NCO2INC16        EQU  H'0000'
NCO2INC17        EQU  H'0001'
NCO2INC18        EQU  H'0002'
NCO2INC19        EQU  H'0003'

INC16            EQU  H'0000'
INC17            EQU  H'0001'
INC18            EQU  H'0002'
INC19            EQU  H'0003'



;----- NCO2CON Bits -----------------------------------------------------
PFM              EQU  H'0000'
POL_NCO2CON      EQU  H'0004'
OUT_NCO2CON      EQU  H'0005'
EN               EQU  H'0007'

NCO2PFM          EQU  H'0000'
NCO2POL          EQU  H'0004'
NCO2OUT          EQU  H'0005'
NCO2EN           EQU  H'0007'


;----- NCO2CLK Bits -----------------------------------------------------
CKS0             EQU  H'0000'
CKS1             EQU  H'0001'
CKS2             EQU  H'0002'
CKS3             EQU  H'0003'
CKS4             EQU  H'0004'
PWS0             EQU  H'0005'
PWS1             EQU  H'0006'
PWS2             EQU  H'0007'


NCO2CKS0         EQU  H'0000'
NCO2CKS1         EQU  H'0001'
NCO2CKS2         EQU  H'0002'
NCO2CKS3         EQU  H'0003'
NCO2CKS4         EQU  H'0004'
NCO2PWS0         EQU  H'0005'
NCO2PWS1         EQU  H'0006'
NCO2PWS2         EQU  H'0007'


;----- NCO3ACCL Bits -----------------------------------------------------
NCO3ACC0         EQU  H'0000'
NCO3ACC1         EQU  H'0001'
NCO3ACC2         EQU  H'0002'
NCO3ACC3         EQU  H'0003'
NCO3ACC4         EQU  H'0004'
NCO3ACC5         EQU  H'0005'
NCO3ACC6         EQU  H'0006'
NCO3ACC7         EQU  H'0007'

ACC0             EQU  H'0000'
ACC1             EQU  H'0001'
ACC2             EQU  H'0002'
ACC3             EQU  H'0003'
ACC4             EQU  H'0004'
ACC5             EQU  H'0005'
ACC6             EQU  H'0006'
ACC7             EQU  H'0007'



;----- NCO3ACCH Bits -----------------------------------------------------
NCO3ACC8         EQU  H'0000'
NCO3ACC9         EQU  H'0001'
NCO3ACC10        EQU  H'0002'
NCO3ACC11        EQU  H'0003'
NCO3ACC12        EQU  H'0004'
NCO3ACC13        EQU  H'0005'
NCO3ACC14        EQU  H'0006'
NCO3ACC15        EQU  H'0007'

ACC8             EQU  H'0000'
ACC9             EQU  H'0001'
ACC10            EQU  H'0002'
ACC11            EQU  H'0003'
ACC12            EQU  H'0004'
ACC13            EQU  H'0005'
ACC14            EQU  H'0006'
ACC15            EQU  H'0007'



;----- NCO3ACCU Bits -----------------------------------------------------
NCO3ACC16        EQU  H'0000'
NCO3ACC17        EQU  H'0001'
NCO3ACC18        EQU  H'0002'
NCO3ACC19        EQU  H'0003'

ACC16            EQU  H'0000'
ACC17            EQU  H'0001'
ACC18            EQU  H'0002'
ACC19            EQU  H'0003'



;----- NCO3INCL Bits -----------------------------------------------------
NCO3INC0         EQU  H'0000'
NCO3INC1         EQU  H'0001'
NCO3INC2         EQU  H'0002'
NCO3INC3         EQU  H'0003'
NCO3INC4         EQU  H'0004'
NCO3INC5         EQU  H'0005'
NCO3INC6         EQU  H'0006'
NCO3INC7         EQU  H'0007'

INC0             EQU  H'0000'
INC1             EQU  H'0001'
INC2             EQU  H'0002'
INC3             EQU  H'0003'
INC4             EQU  H'0004'
INC5             EQU  H'0005'
INC6             EQU  H'0006'
INC7             EQU  H'0007'



;----- NCO3INCH Bits -----------------------------------------------------
NCO3INC8         EQU  H'0000'
NCO3INC9         EQU  H'0001'
NCO3INC10        EQU  H'0002'
NCO3INC11        EQU  H'0003'
NCO3INC12        EQU  H'0004'
NCO3INC13        EQU  H'0005'
NCO3INC14        EQU  H'0006'
NCO3INC15        EQU  H'0007'

INC8             EQU  H'0000'
INC9             EQU  H'0001'
INC10            EQU  H'0002'
INC11            EQU  H'0003'
INC12            EQU  H'0004'
INC13            EQU  H'0005'
INC14            EQU  H'0006'
INC15            EQU  H'0007'



;----- NCO3INCU Bits -----------------------------------------------------
NCO3INC16        EQU  H'0000'
NCO3INC17        EQU  H'0001'
NCO3INC18        EQU  H'0002'
NCO3INC19        EQU  H'0003'

INC16            EQU  H'0000'
INC17            EQU  H'0001'
INC18            EQU  H'0002'
INC19            EQU  H'0003'



;----- NCO3CON Bits -----------------------------------------------------
PFM              EQU  H'0000'
POL_NCO3CON      EQU  H'0004'
OUT_NCO3CON      EQU  H'0005'
EN               EQU  H'0007'

NCO3PFM          EQU  H'0000'
NCO3POL          EQU  H'0004'
NCO3OUT          EQU  H'0005'
NCO3EN           EQU  H'0007'


;----- NCO3CLK Bits -----------------------------------------------------
CKS0             EQU  H'0000'
CKS1             EQU  H'0001'
CKS2             EQU  H'0002'
CKS3             EQU  H'0003'
CKS4             EQU  H'0004'
PWS0             EQU  H'0005'
PWS1             EQU  H'0006'
PWS2             EQU  H'0007'


NCO3CKS0         EQU  H'0000'
NCO3CKS1         EQU  H'0001'
NCO3CKS2         EQU  H'0002'
NCO3CKS3         EQU  H'0003'
NCO3CKS4         EQU  H'0004'
NCO3PWS0         EQU  H'0005'
NCO3PWS1         EQU  H'0006'
NCO3PWS2         EQU  H'0007'


;----- IVTLOCK Bits -----------------------------------------------------
IVTLOCKED        EQU  H'0000'


;----- IVTADL Bits -----------------------------------------------------
AD0              EQU  H'0000'
AD1              EQU  H'0001'
AD2              EQU  H'0002'
AD3              EQU  H'0003'
AD4              EQU  H'0004'
AD5              EQU  H'0005'
AD6              EQU  H'0006'
AD7              EQU  H'0007'


;----- IVTADH Bits -----------------------------------------------------
AD8              EQU  H'0000'
AD9              EQU  H'0001'
AD10             EQU  H'0002'
AD11             EQU  H'0003'
AD12             EQU  H'0004'
AD13             EQU  H'0005'
AD14             EQU  H'0006'
AD15             EQU  H'0007'


